vicara-hq/da14531-tutorials/empty_peripheral_template_blog_interrupts/src/lsm6ds3_reg.h
/*
 ******************************************************************************
 * @file    lsm6ds3_reg.h
 * @author  Sensors Software Solution Team
 * @brief   This file contains all the functions prototypes for the
 *          lsm6ds3_reg.c driver.
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 ******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef LSM6DS3_REGS_H
#define LSM6DS3_REGS_H

#ifdef __cplusplus
  extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include <stdint.h>
#include <math.h>

/** @addtogroup LSM6DS3
  * @{
  *
  */

/** @defgroup STMicroelectronics sensors common types
  * @{
  *
  */

#ifndef MEMS_SHARED_TYPES
#define MEMS_SHARED_TYPES

typedef struct{
  uint8_t bit0       : 1;
  uint8_t bit1       : 1;
  uint8_t bit2       : 1;
  uint8_t bit3       : 1;
  uint8_t bit4       : 1;
  uint8_t bit5       : 1;
  uint8_t bit6       : 1;
  uint8_t bit7       : 1;
} bitwise_t;

#define PROPERTY_DISABLE                (0U)
#define PROPERTY_ENABLE                 (1U)

/** @addtogroup  Interfaces_Functions
  * @brief       This section provide a set of functions used to read and
  *              write a generic register of the device.
  *              MANDATORY: return 0 -> no Error.
  * @{
  *
  */

typedef int32_t (*stmdev_write_ptr)(void *, uint8_t, uint8_t*, uint16_t);
typedef int32_t (*stmdev_read_ptr) (void *, uint8_t, uint8_t*, uint16_t);

typedef struct {
  /** Component mandatory fields **/
  stmdev_write_ptr  write_reg;
  stmdev_read_ptr   read_reg;
  /** Customizable optional pointer **/
  void *handle;
} stmdev_ctx_t;

/**
  * @}
  *
  */

#endif /* MEMS_SHARED_TYPES */

#ifndef MEMS_UCF_SHARED_TYPES
#define MEMS_UCF_SHARED_TYPES

/** @defgroup    Generic address-data structure definition
  * @brief       This structure is useful to load a predefined configuration
  *              of a sensor.
	*              You can create a sensor configuration by your own or using 
	*              Unico / Unicleo tools available on STMicroelectronics
	*              web site.
  *
  * @{
  *
  */

typedef struct {
  uint8_t address;
  uint8_t data;
} ucf_line_t;

/**
  * @}
  *
  */

#endif /* MEMS_UCF_SHARED_TYPES */

/**
  * @}
  *
  */

/** @defgroup LSM6DS3_Infos
  * @{
  *
  */

/** I2C Device Address 8 bit format  if SA0=0 -> 0xD5 if SA0=1 -> 0xD7 **/
#define LSM6DS3_I2C_ADD_L                          0xD5U
#define LSM6DS3_I2C_ADD_H                          0xD7U
/** Device Identification (Who am I) **/
#define LSM6DS3_ID                                 0x69U

/**
  * @}
  *
  */

#define LSM6DS3_FUNC_CFG_ACCESS                    0x01U
typedef struct {
  uint8_t not_used_01                 : 7;
  uint8_t func_cfg_en                 : 1;
} lsm6ds3_func_cfg_access_t;

#define LSM6DS3_SENSOR_SYNC_TIME_FRAME             0x04U
typedef struct {
  uint8_t tph                         : 8;
} lsm6ds3_sensor_sync_time_frame_t;

#define LSM6DS3_FIFO_CTRL1                         0x06U
typedef struct {
  uint8_t fth                         : 8;
} lsm6ds3_fifo_ctrl1_t;

#define LSM6DS3_FIFO_CTRL2                         0x07U
typedef struct {
  uint8_t fth                         : 4;
  uint8_t not_used_01                 : 2;
  uint8_t  timer_pedo_fifo_drdy       : 1;
  uint8_t timer_pedo_fifo_en          : 1;
} lsm6ds3_fifo_ctrl2_t;

#define LSM6DS3_FIFO_CTRL3                         0x08U
typedef struct {
  uint8_t dec_fifo_xl                 : 3;
  uint8_t dec_fifo_gyro               : 3;
  uint8_t not_used_01                 : 2;
} lsm6ds3_fifo_ctrl3_t;

#define LSM6DS3_FIFO_CTRL4                         0x09U
typedef struct {
  uint8_t dec_ds3_fifo                : 3;
  uint8_t dec_ds4_fifo                : 3;
  uint8_t only_high_data              : 1;
  uint8_t not_used_01                 : 1;
} lsm6ds3_fifo_ctrl4_t;

#define LSM6DS3_FIFO_CTRL5                         0x0AU
typedef struct {
  uint8_t fifo_mode                   : 3;
  uint8_t odr_fifo                    : 4;
  uint8_t not_used_01                 : 1;
} lsm6ds3_fifo_ctrl5_t;

#define LSM6DS3_ORIENT_CFG_G                       0x0BU
typedef struct {
  uint8_t orient                      : 3;
  uint8_t sign_g                      : 3;  /* SignX_G) + SignY_G + SignZ_G */
  uint8_t not_used_01                 : 2;
} lsm6ds3_orient_cfg_g_t;

#define LSM6DS3_INT1_CTRL                          0x0DU
typedef struct {
  uint8_t int1_drdy_xl                : 1;
  uint8_t int1_drdy_g                 : 1;
  uint8_t int1_boot                   : 1;
  uint8_t int1_fth                    : 1;
  uint8_t int1_fifo_ovr               : 1;
  uint8_t int1_full_flag              : 1;
  uint8_t int1_sign_mot               : 1;
  uint8_t int1_step_detector          : 1;
} lsm6ds3_int1_ctrl_t;

#define LSM6DS3_INT2_CTRL                          0x0EU
typedef struct {
  uint8_t int2_drdy_xl                : 1;
  uint8_t int2_drdy_g                 : 1;
  uint8_t int2_drdy_temp              : 1;
  uint8_t int2_fth                    : 1;
  uint8_t int2_fifo_ovr               : 1;
  uint8_t int2_full_flag              : 1;
  uint8_t int2_step_count_ov          : 1;
  uint8_t int2_step_delta             : 1;
} lsm6ds3_int2_ctrl_t;

#define LSM6DS3_WHO_AM_I                           0x0FU
#define LSM6DS3_CTRL1_XL                           0x10U
typedef struct {
  uint8_t bw_xl                       : 2;
  uint8_t fs_xl                       : 2;
  uint8_t odr_xl                      : 4;
} lsm6ds3_ctrl1_xl_t;

