vicara-hq/da14531-tutorials/empty_peripheral_template_blog_interrupts/src/lsm6ds3_reg.h
#define LSM6DS3_INT_DUR2                           0x5AU
typedef struct {
  uint8_t shock                       : 2;
  uint8_t quiet                       : 2;
  uint8_t dur                         : 4;
} lsm6ds3_int_dur2_t;

#define LSM6DS3_WAKE_UP_THS                        0x5BU
typedef struct {
  uint8_t wk_ths                      : 6;
  uint8_t inactivity                  : 1;
  uint8_t single_double_tap           : 1;
} lsm6ds3_wake_up_ths_t;

#define LSM6DS3_WAKE_UP_DUR                        0x5CU
typedef struct {
  uint8_t sleep_dur                   : 4;
  uint8_t timer_hr                    : 1;
  uint8_t wake_dur                    : 2;
  uint8_t ff_dur                      : 1;
} lsm6ds3_wake_up_dur_t;

#define LSM6DS3_FREE_FALL                          0x5DU
typedef struct {
  uint8_t ff_ths                      : 3;
  uint8_t ff_dur                      : 5;
} lsm6ds3_free_fall_t;

#define LSM6DS3_MD1_CFG                            0x5EU
typedef struct {
  uint8_t int1_timer                  : 1;
  uint8_t int1_tilt                   : 1;
  uint8_t int1_6d                     : 1;
  uint8_t int1_double_tap             : 1;
  uint8_t int1_ff                     : 1;
  uint8_t int1_wu                     : 1;
  uint8_t int1_single_tap             : 1;
  uint8_t int1_inact_state            : 1;
} lsm6ds3_md1_cfg_t;

#define LSM6DS3_MD2_CFG                            0x5FU
typedef struct {
  uint8_t int2_iron                   : 1;
  uint8_t int2_tilt                   : 1;
  uint8_t int2_6d                     : 1;
  uint8_t int2_double_tap             : 1;
  uint8_t int2_ff                     : 1;
  uint8_t int2_wu                     : 1;
  uint8_t int2_single_tap             : 1;
  uint8_t int2_inact_state            : 1;
} lsm6ds3_md2_cfg_t;

#define LSM6DS3_OUT_MAG_RAW_X_L                    0x66U
#define LSM6DS3_OUT_MAG_RAW_X_H                    0x67U
#define LSM6DS3_OUT_MAG_RAW_Y_L                    0x68U
#define LSM6DS3_OUT_MAG_RAW_Y_H                    0x69U
#define LSM6DS3_OUT_MAG_RAW_Z_L                    0x6AU
#define LSM6DS3_OUT_MAG_RAW_Z_H                    0x6BU
#define LSM6DS3_SLV0_ADD                           0x02U
typedef struct {
  uint8_t rw_0                        : 1;
  uint8_t slave0_add                  : 7;
} lsm6ds3_slv0_add_t;

#define LSM6DS3_SLV0_SUBADD                        0x03U
typedef struct {
  uint8_t slave0_reg                  : 8;
} lsm6ds3_slv0_subadd_t;

#define LSM6DS3_SLAVE0_CONFIG                      0x04U
typedef struct {
  uint8_t slave0_numop                : 3;
  uint8_t src_mode                    : 1;
  uint8_t aux_sens_on                 : 2;
  uint8_t slave0_rate                 : 2;
} lsm6ds3_slave0_config_t;

#define LSM6DS3_SLV1_ADD                           0x05U
typedef struct {
  uint8_t r_1                         : 1;
  uint8_t slave1_add                  : 7;
} lsm6ds3_slv1_add_t;

#define LSM6DS3_SLV1_SUBADD                        0x06U
typedef struct {
  uint8_t slave1_reg                  : 8;
} lsm6ds3_slv1_subadd_t;

#define LSM6DS3_SLAVE1_CONFIG                      0x07U
typedef struct {
  uint8_t slave1_numop                : 3;
  uint8_t not_used_01                 : 3;
  uint8_t slave1_rate                 : 2;
} lsm6ds3_slave1_config_t;

#define LSM6DS3_SLV2_ADD                           0x08U
typedef struct {
  uint8_t r_2                         : 1;
  uint8_t slave2_add                  : 7;
} lsm6ds3_slv2_add_t;

#define LSM6DS3_SLV2_SUBADD                        0x09U
typedef struct {
  uint8_t slave2_reg                  : 8;
} lsm6ds3_slv2_subadd_t;

#define LSM6DS3_SLAVE2_CONFIG                      0x0AU
typedef struct {
  uint8_t slave2_numop                : 3;
  uint8_t not_used_01                 : 3;
  uint8_t slave2_rate                 : 2;
} lsm6ds3_slave2_config_t;

#define LSM6DS3_SLV3_ADD                           0x0BU
typedef struct {
  uint8_t r_3                         : 1;
  uint8_t slave3_add                  : 7;
} lsm6ds3_slv3_add_t;

#define LSM6DS3_SLV3_SUBADD                        0x0CU
typedef struct {
  uint8_t slave3_reg                  : 8;
} lsm6ds3_slv3_subadd_t;

#define LSM6DS3_SLAVE3_CONFIG                      0x0DU
typedef struct {
  uint8_t slave3_numop                : 3;
  uint8_t not_used_01                 : 3;
  uint8_t slave3_rate                 : 2;
} lsm6ds3_slave3_config_t;

#define LSM6DS3_DATAWRITE_SRC_MODE_SUB_SLV0        0x0EU
typedef struct {
  uint8_t slave_dataw                 : 8;
} lsm6ds3_datawrite_src_mode_sub_slv0_t;

#define LSM6DS3_PEDO_THS_REG                       0x0FU
typedef struct {
  uint8_t ths_min                     : 5;
  uint8_t not_used_01                 : 2;
  uint8_t pedo_4g                     : 1;
} lsm6ds3_pedo_ths_reg_t;

#define LSM6DS3_SM_THS                             0x13U
typedef struct {
  uint8_t sm_ths                      : 8;
} lsm6ds3_sm_ths_t;

#define LSM6DS3_PEDO_DEB_REG                       0x14U
typedef struct {
  uint8_t deb_step                    : 3;
  uint8_t deb_time                    : 5;
} lsm6ds3_pedo_deb_reg_t;

#define LSM6DS3_STEP_COUNT_DELTA                   0x15U
typedef struct {
  uint8_t sc_delta                    : 8;
} lsm6ds3_step_count_delta_t;

#define LSM6DS3_MAG_SI_XX                          0x24U
#define LSM6DS3_MAG_SI_XY                          0x25U
#define LSM6DS3_MAG_SI_XZ                          0x26U
#define LSM6DS3_MAG_SI_YX                          0x27U
#define LSM6DS3_MAG_SI_YY                          0x28U
#define LSM6DS3_MAG_SI_YZ                          0x29U
#define LSM6DS3_MAG_SI_ZX                          0x2AU
#define LSM6DS3_MAG_SI_ZY                          0x2BU
#define LSM6DS3_MAG_SI_ZZ                          0x2CU
#define LSM6DS3_MAG_OFFX_L                         0x2DU
#define LSM6DS3_MAG_OFFX_H                         0x2EU
#define LSM6DS3_MAG_OFFY_L                         0x2FU
#define LSM6DS3_MAG_OFFY_H                         0x30U
#define LSM6DS3_MAG_OFFZ_L                         0x31U
#define LSM6DS3_MAG_OFFZ_H                         0x32U

/**
  * @defgroup LSM6DS3_Register_Union
  * @brief    This union group all the registers that has a bit-field
  *           description.
  *           This union is useful but not need by the driver.
  *
  *           REMOVING this union you are compliant with:
  *           MISRA-C 2012 [Rule 19.2] -> " Union are not allowed "
  *
  * @{
  *
  */

typedef union{
  lsm6ds3_func_cfg_access_t                  func_cfg_access;
  lsm6ds3_sensor_sync_time_frame_t           sensor_sync_time_frame;
  lsm6ds3_fifo_ctrl1_t                       fifo_ctrl1;
  lsm6ds3_fifo_ctrl2_t                       fifo_ctrl2;
  lsm6ds3_fifo_ctrl3_t                       fifo_ctrl3;
  lsm6ds3_fifo_ctrl4_t                       fifo_ctrl4;
  lsm6ds3_fifo_ctrl5_t                       fifo_ctrl5;
  lsm6ds3_orient_cfg_g_t                     orient_cfg_g;
  lsm6ds3_int1_ctrl_t                        int1_ctrl;
  lsm6ds3_int2_ctrl_t                        int2_ctrl;
  lsm6ds3_ctrl1_xl_t                         ctrl1_xl;
  lsm6ds3_ctrl2_g_t                          ctrl2_g;
  lsm6ds3_ctrl3_c_t                          ctrl3_c;
  lsm6ds3_ctrl4_c_t                          ctrl4_c;
  lsm6ds3_ctrl5_c_t                          ctrl5_c;
  lsm6ds3_ctrl6_c_t                          ctrl6_c;
  lsm6ds3_ctrl7_g_t                          ctrl7_g;
  lsm6ds3_ctrl8_xl_t                         ctrl8_xl;
  lsm6ds3_ctrl9_xl_t                         ctrl9_xl;
  lsm6ds3_ctrl10_c_t                         ctrl10_c;
  lsm6ds3_master_config_t                    master_config;
  lsm6ds3_wake_up_src_t                      wake_up_src;
  lsm6ds3_tap_src_t                          tap_src;
  lsm6ds3_d6d_src_t                          d6d_src;
  lsm6ds3_status_reg_t                       status_reg;
  lsm6ds3_sensorhub1_reg_t                   sensorhub1_reg;
  lsm6ds3_sensorhub2_reg_t                   sensorhub2_reg;
  lsm6ds3_sensorhub3_reg_t                   sensorhub3_reg;
  lsm6ds3_sensorhub4_reg_t                   sensorhub4_reg;
  lsm6ds3_sensorhub5_reg_t                   sensorhub5_reg;
  lsm6ds3_sensorhub6_reg_t                   sensorhub6_reg;
  lsm6ds3_sensorhub7_reg_t                   sensorhub7_reg;
  lsm6ds3_sensorhub8_reg_t                   sensorhub8_reg;
  lsm6ds3_sensorhub9_reg_t                   sensorhub9_reg;
  lsm6ds3_sensorhub10_reg_t                  sensorhub10_reg;
  lsm6ds3_sensorhub11_reg_t                  sensorhub11_reg;
  lsm6ds3_sensorhub12_reg_t                  sensorhub12_reg;
  lsm6ds3_fifo_status1_t                     fifo_status1;
  lsm6ds3_fifo_status2_t                     fifo_status2;
  lsm6ds3_fifo_status3_t                     fifo_status3;
  lsm6ds3_fifo_status4_t                     fifo_status4;
  lsm6ds3_sensorhub13_reg_t                  sensorhub13_reg;
  lsm6ds3_sensorhub14_reg_t                  sensorhub14_reg;
  lsm6ds3_sensorhub15_reg_t                  sensorhub15_reg;
  lsm6ds3_sensorhub16_reg_t                  sensorhub16_reg;
  lsm6ds3_sensorhub17_reg_t                  sensorhub17_reg;
  lsm6ds3_sensorhub18_reg_t                  sensorhub18_reg;
  lsm6ds3_func_src_t                         func_src;
  lsm6ds3_tap_cfg_t                          tap_cfg;
  lsm6ds3_tap_ths_6d_t                       tap_ths_6d;
  lsm6ds3_int_dur2_t                         int_dur2;
  lsm6ds3_wake_up_ths_t                      wake_up_ths;
  lsm6ds3_wake_up_dur_t                      wake_up_dur;
  lsm6ds3_free_fall_t                        free_fall;
  lsm6ds3_md1_cfg_t                          md1_cfg;
  lsm6ds3_md2_cfg_t                          md2_cfg;
  lsm6ds3_slv0_add_t                         slv0_add;
  lsm6ds3_slv0_subadd_t                      slv0_subadd;
  lsm6ds3_slave0_config_t                    slave0_config;
  lsm6ds3_slv1_add_t                         slv1_add;
  lsm6ds3_slv1_subadd_t                      slv1_subadd;
  lsm6ds3_slave1_config_t                    slave1_config;
  lsm6ds3_slv2_add_t                         slv2_add;
  lsm6ds3_slv2_subadd_t                      slv2_subadd;
  lsm6ds3_slave2_config_t                    slave2_config;
  lsm6ds3_slv3_add_t                         slv3_add;
  lsm6ds3_slv3_subadd_t                      slv3_subadd;
  lsm6ds3_slave3_config_t                    slave3_config;
  lsm6ds3_datawrite_src_mode_sub_slv0_t      datawrite_src_mode_sub_slv0;
  lsm6ds3_pedo_ths_reg_t                     pedo_ths_reg;
  lsm6ds3_sm_ths_t                           sm_ths;
  lsm6ds3_pedo_deb_reg_t                     pedo_deb_reg;
  lsm6ds3_step_count_delta_t                 step_count_delta;
  bitwise_t                                  bitwise;
  uint8_t                                    byte;
} lsm6ds3_reg_t;

/**
  * @}
  *
  */

int32_t lsm6ds3_read_reg(stmdev_ctx_t *ctx, uint8_t reg, uint8_t* data,
                         uint16_t len);
int32_t lsm6ds3_write_reg(stmdev_ctx_t *ctx, uint8_t reg, uint8_t* data,
                          uint16_t len);

extern float_t lsm6ds3_from_fs2g_to_mg(int16_t lsb);
extern float_t lsm6ds3_from_fs4g_to_mg(int16_t lsb);
extern float_t lsm6ds3_from_fs8g_to_mg(int16_t lsb);
extern float_t lsm6ds3_from_fs16g_to_mg(int16_t lsb);

