vicara-hq/da14531-tutorials/empty_peripheral_template_blog_interrupts/src/lsm6ds3_reg.h
typedef enum {
  LSM6DS3_USER_BANK                                = 0,
  LSM6DS3_EMBEDDED_FUNC_BANK                       = 1,
} lsm6ds3_func_cfg_en_t;
int32_t lsm6ds3_mem_bank_set(stmdev_ctx_t *ctx, lsm6ds3_func_cfg_en_t val);
int32_t lsm6ds3_mem_bank_get(stmdev_ctx_t *ctx, lsm6ds3_func_cfg_en_t *val);

int32_t lsm6ds3_device_id_get(stmdev_ctx_t *ctx, uint8_t *buff);

int32_t lsm6ds3_reset_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_reset_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DS3_LSB_AT_LOW_ADD = 0,
  LSM6DS3_MSB_AT_LOW_ADD = 1,
} lsm6ds3_ble_t;
int32_t lsm6ds3_data_format_set(stmdev_ctx_t *ctx, lsm6ds3_ble_t val);
int32_t lsm6ds3_data_format_get(stmdev_ctx_t *ctx, lsm6ds3_ble_t *val);

int32_t lsm6ds3_auto_increment_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_auto_increment_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3_boot_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_boot_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DS3_XL_ST_DISABLE  = 0,
  LSM6DS3_XL_ST_POSITIVE = 1,
  LSM6DS3_XL_ST_NEGATIVE = 2,
} lsm6ds3_st_xl_t;
int32_t lsm6ds3_xl_self_test_set(stmdev_ctx_t *ctx, lsm6ds3_st_xl_t val);
int32_t lsm6ds3_xl_self_test_get(stmdev_ctx_t *ctx, lsm6ds3_st_xl_t *val);

typedef enum {
  LSM6DS3_GY_ST_DISABLE  = 0,
  LSM6DS3_GY_ST_POSITIVE = 1,
  LSM6DS3_GY_ST_NEGATIVE = 3,
} lsm6ds3_st_g_t;
int32_t lsm6ds3_gy_self_test_set(stmdev_ctx_t *ctx, lsm6ds3_st_g_t val);
int32_t lsm6ds3_gy_self_test_get(stmdev_ctx_t *ctx, lsm6ds3_st_g_t *val);

int32_t lsm6ds3_filter_settling_mask_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_filter_settling_mask_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DS3_HP_CUT_OFF_8mHz1   = 0,
  LSM6DS3_HP_CUT_OFF_32mHz4  = 1,
  LSM6DS3_HP_CUT_OFF_2Hz07   = 2,
  LSM6DS3_HP_CUT_OFF_16Hz32  = 3,
} lsm6ds3_hpcf_g_t;
int32_t lsm6ds3_gy_hp_bandwidth_set(stmdev_ctx_t *ctx, lsm6ds3_hpcf_g_t val);
int32_t lsm6ds3_gy_hp_bandwidth_get(stmdev_ctx_t *ctx, lsm6ds3_hpcf_g_t *val);

int32_t lsm6ds3_gy_hp_reset_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_gy_hp_reset_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DS3_XL_HP_ODR_DIV_4   = 0,
  LSM6DS3_XL_HP_ODR_DIV_100 = 1,
  LSM6DS3_XL_HP_ODR_DIV_9   = 2,
  LSM6DS3_XL_HP_ODR_DIV_400 = 3,
} lsm6ds3_hp_bw_t;
int32_t lsm6ds3_xl_hp_bandwidth_set(stmdev_ctx_t *ctx, lsm6ds3_hp_bw_t val);
int32_t lsm6ds3_xl_hp_bandwidth_get(stmdev_ctx_t *ctx, lsm6ds3_hp_bw_t *val);

typedef enum {
  LSM6DS3_XL_LP_ODR_DIV_50  = 0,
  LSM6DS3_XL_LP_ODR_DIV_100 = 1,
  LSM6DS3_XL_LP_ODR_DIV_9   = 2,
  LSM6DS3_XL_LP_ODR_DIV_400 = 3,
} lsm6ds3_lp_bw_t;
int32_t lsm6ds3_xl_lp2_bandwidth_set(stmdev_ctx_t *ctx, lsm6ds3_lp_bw_t val);
int32_t lsm6ds3_xl_lp2_bandwidth_get(stmdev_ctx_t *ctx, lsm6ds3_lp_bw_t *val);

typedef enum {
  LSM6DS3_ANTI_ALIASING_400Hz = 0,
  LSM6DS3_ANTI_ALIASING_200Hz = 1,
  LSM6DS3_ANTI_ALIASING_100Hz = 2,
  LSM6DS3_ANTI_ALIASING_50Hz  = 3,
} lsm6ds3_bw_xl_t;
int32_t lsm6ds3_xl_filter_analog_set(stmdev_ctx_t *ctx, lsm6ds3_bw_xl_t val);
int32_t lsm6ds3_xl_filter_analog_get(stmdev_ctx_t *ctx, lsm6ds3_bw_xl_t *val);

typedef enum {
  LSM6DS3_SPI_4_WIRE = 0,
  LSM6DS3_SPI_3_WIRE = 1,
} lsm6ds3_sim_t;
int32_t lsm6ds3_spi_mode_set(stmdev_ctx_t *ctx, lsm6ds3_sim_t val);
int32_t lsm6ds3_spi_mode_get(stmdev_ctx_t *ctx, lsm6ds3_sim_t *val);

typedef enum {
  LSM6DS3_I2C_ENABLE  = 0,
  LSM6DS3_I2C_DISABLE = 1,
} lsm6ds3_i2c_dis_t;
int32_t lsm6ds3_i2c_interface_set(stmdev_ctx_t *ctx, lsm6ds3_i2c_dis_t val);
int32_t lsm6ds3_i2c_interface_get(stmdev_ctx_t *ctx, lsm6ds3_i2c_dis_t *val);

typedef struct {
  uint8_t  int1_drdy_xl         : 1;
  uint8_t  int1_drdy_g          : 1;
  uint8_t  int1_boot            : 1;
  uint8_t  int1_fth             : 1;
  uint8_t  int1_fifo_ovr        : 1;
  uint8_t  int1_full_flag       : 1;
  uint8_t  int1_sign_mot        : 1;
  uint8_t  int1_step_detector   : 1;
  uint8_t  int1_timer           : 1;
  uint8_t  int1_tilt            : 1;
  uint8_t  int1_6d              : 1;
  uint8_t  int1_double_tap      : 1;
  uint8_t  int1_ff              : 1;
  uint8_t  int1_wu              : 1;
  uint8_t  int1_single_tap      : 1;
  uint8_t  int1_inact_state     : 1;
  uint8_t  drdy_on_int1         : 1;
} lsm6ds3_int1_route_t;
int32_t lsm6ds3_pin_int1_route_set(stmdev_ctx_t *ctx,
                                   lsm6ds3_int1_route_t *val);
int32_t lsm6ds3_pin_int1_route_get(stmdev_ctx_t *ctx,
                                   lsm6ds3_int1_route_t *val);

typedef struct {
  uint8_t int2_drdy_xl          : 1;
  uint8_t int2_drdy_g           : 1;
  uint8_t int2_drdy_temp        : 1;
  uint8_t int2_fth              : 1;
  uint8_t int2_fifo_ovr         : 1;
  uint8_t int2_full_flag        : 1;
  uint8_t int2_step_count_ov    : 1;
  uint8_t int2_step_delta       : 1;
  uint8_t int2_iron             : 1;
  uint8_t int2_tilt             : 1;
  uint8_t int2_6d               : 1;
  uint8_t int2_double_tap       : 1;
  uint8_t int2_ff               : 1;
  uint8_t int2_wu               : 1;
  uint8_t int2_single_tap       : 1;
  uint8_t int2_inact_state      : 1;
  uint8_t start_config          : 1;
} lsm6ds3_int2_route_t;
int32_t lsm6ds3_pin_int2_route_set(stmdev_ctx_t *ctx, lsm6ds3_int2_route_t *val);
int32_t lsm6ds3_pin_int2_route_get(stmdev_ctx_t *ctx, lsm6ds3_int2_route_t *val);

typedef enum {
  LSM6DS3_PUSH_PULL  = 0,
  LSM6DS3_OPEN_DRAIN = 1,
} lsm6ds3_pp_od_t;
int32_t lsm6ds3_pin_mode_set(stmdev_ctx_t *ctx, lsm6ds3_pp_od_t val);
int32_t lsm6ds3_pin_mode_get(stmdev_ctx_t *ctx, lsm6ds3_pp_od_t *val);

typedef enum {
  LSM6DS3_ACTIVE_HIGH = 0,
  LSM6DS3_ACTIVE_LOW  = 1,
} lsm6ds3_pin_pol_t;
int32_t lsm6ds3_pin_polarity_set(stmdev_ctx_t *ctx, lsm6ds3_pin_pol_t val);
int32_t lsm6ds3_pin_polarity_get(stmdev_ctx_t *ctx,  lsm6ds3_pin_pol_t *val);

int32_t lsm6ds3_all_on_int1_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_all_on_int1_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DS3_INT_PULSED  = 0,
  LSM6DS3_INT_LATCHED = 1,
} lsm6ds3_lir_t;
int32_t lsm6ds3_int_notification_set(stmdev_ctx_t *ctx, lsm6ds3_lir_t val);
int32_t lsm6ds3_int_notification_get(stmdev_ctx_t *ctx, lsm6ds3_lir_t *val);

int32_t lsm6ds3_wkup_src_get(stmdev_ctx_t *ctx, lsm6ds3_wake_up_src_t *val);

int32_t lsm6ds3_wkup_threshold_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3_wkup_threshold_get(stmdev_ctx_t *ctx, uint8_t *val);

