vicara-hq/da14531-tutorials/empty_peripheral_template_blog_interrupts/src/lsm6ds3_reg.h
typedef enum {
  LSM6DS3_SLV_0        = 0,
  LSM6DS3_SLV_0_1      = 1,
  LSM6DS3_SLV_0_1_2    = 2,
  LSM6DS3_SLV_0_1_2_3  = 3,
} lsm6ds3_aux_sens_on_t;
int32_t lsm6ds3_sh_num_of_dev_connected_set(stmdev_ctx_t *ctx,
                                            lsm6ds3_aux_sens_on_t val);
int32_t lsm6ds3_sh_num_of_dev_connected_get(stmdev_ctx_t *ctx,
                                            lsm6ds3_aux_sens_on_t *val);

typedef struct{
  uint8_t   slv0_add;
  uint8_t   slv0_subadd;
  uint8_t   slv0_data;
} lsm6ds3_sh_cfg_write_t;
int32_t lsm6ds3_sh_cfg_write(stmdev_ctx_t *ctx, lsm6ds3_sh_cfg_write_t *val);

typedef struct{
  uint8_t   slv_add;
  uint8_t   slv_subadd;
  uint8_t   slv_len;
} lsm6ds3_sh_cfg_read_t;
int32_t lsm6ds3_sh_slv0_cfg_read(stmdev_ctx_t *ctx,
                                 lsm6ds3_sh_cfg_read_t *val);
int32_t lsm6ds3_sh_slv1_cfg_read(stmdev_ctx_t *ctx,
                                 lsm6ds3_sh_cfg_read_t *val);
int32_t lsm6ds3_sh_slv2_cfg_read(stmdev_ctx_t *ctx,
                                 lsm6ds3_sh_cfg_read_t *val);
int32_t lsm6ds3_sh_slv3_cfg_read(stmdev_ctx_t *ctx,
                                 lsm6ds3_sh_cfg_read_t *val);

int32_t lsm6ds3_sh_end_op_flag_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DS3_USE_SLOPE = 0,
  LSM6DS3_USE_HPF   = 1,
} lsm6ds3_slope_fds_t;
int32_t lsm6ds3_xl_hp_path_internal_set(stmdev_ctx_t *ctx,
                                        lsm6ds3_slope_fds_t val);
int32_t lsm6ds3_xl_hp_path_internal_get(stmdev_ctx_t *ctx,
                                        lsm6ds3_slope_fds_t *val);

/**
  *@}
  *
  */

#ifdef __cplusplus
}
#endif

#endif /* LSM6DS3_REGS_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
